---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
source: html/599ae1ec-0d4b-f61b-1a17-43440a90b671.htm
---
# AnalyticalSurfaceBase Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.